## 创建数据库连接

In [2]:
%load_ext sql
%config SqlMagic.autocommit=True
%sql mssql+pyodbc://sa:Lily870104@MSSQLTest

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

*1. insert 語句，列名和列值要一一對應，否則會有error*

In [4]:
%%sql use emp_db
    commit

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[]

In [5]:
%%sql create table dept1(
    deptno int primary key,
    dept_name varchar(50),
    loc varchar(50)
    );

    commit

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [6]:
%%sql insert into dept1(deptno, dept_name) values(50, 'HR');
    commit

 * mssql+pyodbc://sa:***@MSSQLTest
1 rows affected.
Done.

[]

In [10]:
%sql select top 1000 * from dept1;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(50, 'HR', None)]

*字段类型不匹配会产生error*

In [11]:
%%sql insert into dept1(deptno, dept_name) values('HR', 70);
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
(pyodbc.DataError) ('22018', "[22018] [Microsoft][ODBC Driver 18 for SQL Server][SQL Server]Conversion failed when converting the varchar value 'HR' to data type int. (245) (SQLExecDirectW)")
[SQL: insert into dept1(deptno, dept_name) values('HR', 70);]
(Background on this error at: https://sqlalche.me/e/20/9h9h)

*insert到所有不为null的列，按照列名的顺序来插，可以不用在dept表名后面加列名*

In [12]:
%%sql insert into dept1 values(80, 'IT', '上海');
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
1 rows affected.
Done.

[]

In [14]:
%sql select top 1000 * from dept1;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(50, 'HR', None), (80, 'IT', '上海')]

*string 列要放在 单引号里面，否则会报错*

In [16]:
%%sql insert into dept1 values(90, Sales, '北京');
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
(pyodbc.ProgrammingError) ('42S22', "[42S22] [Microsoft][ODBC Driver 18 for SQL Server][SQL Server]Invalid column name 'Sales'. (207) (SQLExecDirectW)")
[SQL: insert into dept1 values(90, Sales, '北京' );]
(Background on this error at: https://sqlalche.me/e/20/f405)

*Insert as 语句* <br>
*把dept表中的所有数据插入到dept1中*

In [18]:
%%sql create table dept(
    deptno int primary key,
    dept_name varchar(50),
    loc varchar(50)
    );

    commit

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [22]:
%%sql insert into dept(deptno, dept_name, loc) values(90, 'AfterSales', '武汉'), 
    (100, 'Marketing', '深圳');
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
2 rows affected.
Done.

[]

In [25]:
%sql select * from dept;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(90, 'AfterSales', '武汉'), (100, 'Marketing', '深圳')]

In [26]:
%%sql insert into dept1(deptno, dept_name, loc) (select deptno, dept_name, loc from dept);
    commit

 * mssql+pyodbc://sa:***@MSSQLTest
2 rows affected.
Done.

[]

In [28]:
%sql select top 1000 * from dept1;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(50, 'HR', None),
 (80, 'IT', '上海'),
 (90, 'AfterSales', '武汉'),
 (100, 'Marketing', '深圳')]

*如果想要只插入部分行，需要用where过滤*

In [29]:
%%sql delete from dept1 where deptno=90 or deptno=100;
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
2 rows affected.
Done.

[]

In [30]:
%%sql insert into dept1(deptno, dept_name, loc) 
    (select * from dept where deptno > 90);
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
1 rows affected.
Done.

[]

In [34]:
%sql select top 1000 * from dept1;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(50, 'HR', None), (80, 'IT', '上海'), (100, 'Marketing', '深圳')]

*也不是所有列都必须要insert的，也可以只insert部分列*<br>
*划线的两个地方的顺序要一致*

In [35]:
%%sql delete from dept1 where deptno=100;
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
1 rows affected.
Done.

[]

In [36]:
%%sql insert into dept1(deptno, dept_name)
    (select deptno, dept_name from dept);
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
2 rows affected.
Done.

[]

In [38]:
%sql select top 1000 * from dept1;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(50, 'HR', None),
 (80, 'IT', '上海'),
 (90, 'AfterSales', None),
 (100, 'Marketing', None)]

*列的顺序很重要，搞错了就会翻车*

In [40]:
%%sql delete from dept1 where deptno >= 90;
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
2 rows affected.
Done.

[]

In [43]:
%%sql insert into dept1(deptno, dept_name) (select dept_name, deptno from dept);
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
(pyodbc.DataError) ('22018', "[22018] [Microsoft][ODBC Driver 18 for SQL Server][SQL Server]Conversion failed when converting the varchar value 'AfterSales' to data type int. (245) (SQLExecDirectW)")
[SQL: insert into dept1(deptno, dept_name) (select dept_name, deptno from dept);]
(Background on this error at: https://sqlalche.me/e/20/9h9h)

*另外一个要注意的点是，当要插入到数据表时，所有不为null的数据列都必须要提供数据*<br>
*dept_name不能为空，不能跳过*

In [45]:
%%sql insert into dept1(dept_name, loc) (select dept_name, loc from dept);
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
(pyodbc.IntegrityError) ('23000', "[23000] [Microsoft][ODBC Driver 18 for SQL Server][SQL Server]Cannot insert the value NULL into column 'deptno', table 'emp_db.dbo.dept1'; column does not allow nulls. INSERT fails. (515) (SQLExecDirectW)")
[SQL: insert into dept1(dept_name, loc) (select dept_name, loc from dept);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)